vin_research/product_groups_response.xml

<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:Error xmlns:ns2="http://server.cat.tecdoc.net"><status>400</status><statusText>Unknown Call: getProductGroups</statusText></ns2:Error></S:Body></S:Envelope>